yellow-new/ThreePhase_VSG/3.Software/F280049_ThreePhase_VSG/device/driverlib/inc/hw_xbar.h
//*************************************************************************************************
//
// The following are defines for the bit fields in the XBARCLR4 register
//
//*************************************************************************************************
#define XBAR_CLR4_SD2FLT1_COMPZ   0x1U          // Input Flag clear for SD2FLT1.COMPZ Signal
#define XBAR_CLR4_SD2FLT1_DRINT   0x2U          // Input Flag clear for SD2FLT1.DRINT Signal
#define XBAR_CLR4_SD2FLT2_COMPZ   0x4U          // Input Flag clear for SD2FLT2.COMPZ Signal
#define XBAR_CLR4_SD2FLT2_DRINT   0x8U          // Input Flag clear for SD2FLT2.DRINT Signal
#define XBAR_CLR4_SD2FLT3_COMPZ   0x10U         // Input Flag clear for SD2FLT3.COMPZ Signal
#define XBAR_CLR4_SD2FLT3_DRINT   0x20U         // Input Flag clear for SD2FLT3.DRINT Signal
#define XBAR_CLR4_SD2FLT4_COMPZ   0x40U         // Input Flag clear for SD2FLT4.COMPZ Signal
#define XBAR_CLR4_SD2FLT4_DRINT   0x80U         // Input Flag clear for SD2FLT4.DRINT Signal
#define XBAR_CLR4_CLB7_4_1        0x1000U       // Input Flag clear for CLB7_4_1 Signal
#define XBAR_CLR4_CLB7_5_1        0x2000U       // Input Flag clear for CLB7_5_1 Signal
#define XBAR_CLR4_CLB8_4_1        0x4000U       // Input Flag clear for CLB8_4_1 Signal
#define XBAR_CLR4_CLB8_5_1        0x8000U       // Input Flag clear for CLB8_5_1 Signal
#define XBAR_CLR4_CLB1_OUT4       0x10000U      // Input Flag clear for CLB1_OUT4 Signal
#define XBAR_CLR4_CLB1_OUT5       0x20000U      // Input Flag clear for CLB1_OUT5 Signal
#define XBAR_CLR4_CLB2_OUT4       0x40000U      // Input Flag clear for CLB2_OUT4 Signal
#define XBAR_CLR4_CLB2_OUT5       0x80000U      // Input Flag clear for CLB2_OUT5 Signal
#define XBAR_CLR4_CLB3_OUT4       0x100000U     // Input Flag clear for CLB3_OUT4 Signal
#define XBAR_CLR4_CLB3_OUT5       0x200000U     // Input Flag clear for CLB3_OUT5 Signal
#define XBAR_CLR4_CLB4_OUT4       0x400000U     // Input Flag clear for CLB4_OUT4 Signal
#define XBAR_CLR4_CLB4_OUT5       0x800000U     // Input Flag clear for CLB4_OUT5 Signal
#define XBAR_CLR4_CLAHALT         0x80000000U   // Input Flag clear for CLAHALT Signal



#endif
